docs: update aws notes
