--- a/docs/aws-certified-devops-engineer–professional-DOP-C02.md
+++ b/docs/aws-certified-devops-engineer–professional-DOP-C02.md
@@ -372,20 +343,12 @@ _You need to review CodeBuild logs and notify personnel of new logs._
-**NOTE:** CloudWatch Events has recently been rebranded to EventBridge Events
+**NOTE:** CloudWatch Events has recently been re-branded to EventBridge Events
 
-```
- +-----------+       +------------+
- | CodeBuild +------>| CloudWatch |
- +-----------+       |    Logs    |
-                     +------------+
-
-
-+--------------+
-|  CloudWatch  |       +--------+       +-------+
-| /EventBridge +------>| Lambda +------>| Slack |
-|    Events    |       +--------+       +-------+
-+--------------+
+```mermaid
+flowchart LR
+    id1["Codebuild"] --> id2["CloudWatch Logs"]
+    id3["CloudWatch/EventBridge Events"] --> id4["Lambda"] --> id5["Slack"]
 ```
 
 - **Input**: You must provide CodeBuild _with a build project_.
